#include <stdio.h>

int main() {
    // w06-02-01
    int i = 1, j = 2, k;

    printf("w06-02-01:\n");   //แสดงค่า "w06-02-01:"

    printf("บรรทัดที่ 1: กำหนดค่าเริ่มต้น → i = %d, j = %d\n", i, j);   //แสดงค่าบรรทัดที่1 กำหนดค่าเริ่มต้นของ i,j

    k = i + j;
    printf("บรรทัดที่ 2: k = i + j = %d + %d = %d\n", i, j, k);   //แสดงผลบรรทัดที่2 แสดงค่าk จาก k= i+j

    i = i + (k * j);
    printf("บรรทัดที่ 3: i = i + (k * j) = %d + (%d * %d) = %d\n", i + (k * j), k, j, i);   //แสดงผลบรรทัดที่3 ค่าi จาก i+(k * j)  

    j = i / 2;
    printf("บรรทัดที่ 4: j = i / 2 = %d / 2 = %d\n", i, j);       //แสดงผลบรรทัดที่ 4 แสดงค่าj จาก i/2

    k = j % 2;
    printf("บรรทัดที่ 5: k = j %% 2 = %d %% 2 = %d\n", j, k);     //แสดงผลบรรทัดที่ 5 แสดงค่า K จาก j%%2 

    i = (j + k) * 3;
    printf("บรรทัดที่ 6: i = (j + k) * 3 = (%d + %d) * 3 = %d\n", j, k, i);     //แสดงผลบรรทัดที่ 6 แสดงค่า i จาก j+k

    printf("บรรทัดที่ 7: ผลลัพธ์สุดท้าย → i = %d, j = %d, k = %d\n\n", i, j, k);   //แสดง ค่า i,j,k

    // w06-02-02
    double x = 1.0, y = 2.0, z;    //กำหนดค่า x และ y

    printf("w06-02-02:\n");    //แสดงค่า "w06-02-02:"

    printf("บรรทัดที่ 1: กำหนดค่าเริ่มต้น → x = %.1f, y = %.1f\n", x, y);    //แสดงค่าบรรทัดที่ 1 ค่า x = 1.0 y = 2.0

    x = y + 5.0;
    printf("บรรทัดที่ 2: x = y + 5.0 = %.1f + 5.0 = %.1f\n", y, x);     //แสดงผลบรรทัดที่ 2 แสดงค่า x จาก y+5.0

    y = x / 2.0;
    printf("บรรทัดที่ 3: y = x / 2.0 = %.1f / 2.0 = %.1f\n", x, y);    //แสดงค่า y จาก x/2.0

    y = (x * 3.0) + 4.0;
    printf("บรรทัดที่ 4: y = (x * 3.0) + 4.0 = (%.1f * 3.0) + 4.0 = %.1f\n", x, y);    //แสดงค่า y จาก (x*3.0) +4.0      

    x = -0.5 * y;
    printf("บรรทัดที่ 5: x = -0.5 * y = -0.5 * %.1f = %.1f\n", y, x);    //แสดงผลบรรทัดที่ 5 แสดงค่า x จาก -0.5*y

    z = x + y;
    printf("บรรทัดที่ 6: z = x + y = %.1f + %.1f = %.1f\n", x, y, z);   //แสดงค่าบรรทัดที่ 6 แสดงค่า z จากx+y

    printf("บรรทัดที่ 7: ผลลัพธ์สุดท้าย → x = %.1f, y = %.1f, z = %.1f\n", x, y, z);   //แสดงผลบรรทัดที่ 7 แสดงค่า x,y,z

    return 0;
}

//1.คำนวณค่า k=1+2 ดังนั้น k=3
//2.คำนวณค่า i=1+(3*2) ดังนั้น i=7
//3.คำนวณค่า j=7/2 ดังนั้น j=3
//4.คำนวณค่า k=3%2 ดังนั้น k=1
//5.คำนวณค่า i=(3+1)*3 ดังนั้น i=12
            //ผลลัพธ์สุดท้ายคือ i=12 j=3 k=1
//2.1คำนวณค่า x=2.0+5.0 ดังนั้น x=7.0
//2.2คำนวณค่า y=7.0/2.0 ดังนั้น y=3.5
//2.3คำนวณค่า y=(7.0*3.0)+4.0 ดังนั้น y=25.0
//2.4คำนวณค่า x=-0.5*25.0 ดังนั้น x=-12.5
//2.5คำนวณค่า z=-12.5+25.0 ดังนั้น z=12.5
            //ผลลัพธ์สุดท้ายคือ x=-12.5 y=25.0 z=12.5